document.addEventListener("DOMContentLoaded", () => {

})

//не наслідувати функціонал і візуал калькулятора айфон. вивести на екран у різні функції ловити через івент лістенер
// кнопки діляться на 3 групи . написати логіку яка працює з кнопками цифри і виводить їхнє значення.  написати логіку яка працює з кнопками оператори і виводить їхнє значення. логіка як відбуватимуться математичні операції
// innerHTML textContent 
// конвертація string в Number
// коли натискаєш дорівнює, запускається функція, яка бере 3 параметра на вході перший - цифра 1, другий - цифра 2, третій оператор
//створення змінної, значення якої не призначене, напикрад let result
//запуск switch, у якого параментр - оператор, який функція передає в switch. кожен case перевіряє оператор та виконує відповідну операцію. значення він бере з функції number1, number2
// після цього switch повертає результат і записує його в зміннну result
// останній рядок функції - return результат 
// взяти result і вивести на екран 